location = {
    "1/15 Działownia": ((50.07187027508017, 19.93988453091538), "Działownia"),
    "N": ((50.072163444455974, 19.942575870551735), "Wydział Architektury"),
    "wykładowa KI": ((50.07156827977979, 19.94151594087066), "Wydział Inżynierii i Technologii Chemicznej, Katedra Informatyki"),
    "135(L2), 136(L1,) 151(L3)": ((50.07156827977979, 19.94151594087066), "Wydział Inżynierii i Technologii Chemicznej, Katedra Informatyki"),
    "131": ((50.07249177318017, 19.941202011427816), "Budynek Houston"),
    "138, 149b, 150": ((50.07153280765432, 19.94233130647946), "SJO"),
    "S1": ((50.0725451329549, 19.943661750659352), "GIL"),
    "S2": ((50.0725451329549, 19.943661750659352), "GIL"),
    "S3": ((50.0725451329549, 19.943661750659352), "GIL"),
    "114 GIL": ((50.0725451329549, 19.943661750659352), "GIL"),
    "F020": ((50.07556605950565, 19.909516272369306), "Wydział Architektruy, ul. Podchorążych")
}